#+TITLE: Solutions

* Python
** Reading numbers from file
#+begin_src python :results output
def read(filename):
    with open(filename, 'r') as f:
        return [int(x) for x in f.readlines()]

read('sample_input.txt')
#+end_src

#+RESULTS:
: [199, 200, 208, 210, 200, 207, 240, 269, 260, 263]

** Part 1
#+begin_src python :results output
def read(filename):
    with open(filename, 'r') as f:
        return [int(x) for x in f.readlines()]

def get_increase_count(nums):
    count = 0
    for i in range(1, len(nums)):
        prev = nums[i - 1]
        curr = nums[i]
        if curr > prev:
            count += 1
    return count

print("result with sample_input: {}".format(get_increase_count(read('sample_input.txt'))))
print("result with input: {}".format(get_increase_count(read('input.txt'))))
#+end_src

#+RESULTS:
: result with sample_input: 7
: result with input: 1583
** Part 2
#+begin_src python :results output
def read(filename):
    with open(filename, 'r') as f:
        return [int(x) for x in f.readlines()]

def get_increase_count(nums):
    window_size = 3
    count = 0
    prev_window_sum = 0;
    for i in range(window_size):
        prev_window_sum += nums[i]
    for i in range(window_size, len(nums)):
        curr_window_sum = prev_window_sum - nums[i - window_size] + nums[i]
        if curr_window_sum > prev_window_sum:
            count += 1
        prev_window_sum = curr_window_sum
    return count

print("result with sample_input: {}".format(get_increase_count(read('sample_input.txt'))))
print("result with input: {}".format(get_increase_count(read('input.txt'))))
#+end_src

#+RESULTS:
: result with sample_input: 5
: result with input: 1627
